 /*********************************************************************/
 /*  CICSDEF.INC - CICS Definitions and Constants                    */
 /*                                                                   */
 /*  Constants and declarations for CICS transaction processing      */
 /*  Demonstrates CICS interface definitions                         */
 /*********************************************************************/

 /* CICS Response Codes */
 DECLARE DFHRESP_NORMAL        FIXED BIN(31) VALUE(0)  STATIC;
 DECLARE DFHRESP_ERROR         FIXED BIN(31) VALUE(1)  STATIC;
 DECLARE DFHRESP_NOTFND        FIXED BIN(31) VALUE(13) STATIC;
 DECLARE DFHRESP_DUPREC        FIXED BIN(31) VALUE(14) STATIC;
 DECLARE DFHRESP_DUPKEY        FIXED BIN(31) VALUE(15) STATIC;
 DECLARE DFHRESP_INVREQ        FIXED BIN(31) VALUE(16) STATIC;
 DECLARE DFHRESP_IOERR         FIXED BIN(31) VALUE(17) STATIC;
 DECLARE DFHRESP_NOSPACE       FIXED BIN(31) VALUE(19) STATIC;
 DECLARE DFHRESP_NOTOPEN       FIXED BIN(31) VALUE(20) STATIC;
 DECLARE DFHRESP_ENDFILE       FIXED BIN(31) VALUE(21) STATIC;
 DECLARE DFHRESP_ILLOGIC       FIXED BIN(31) VALUE(22) STATIC;
 DECLARE DFHRESP_DISABLED      FIXED BIN(31) VALUE(24) STATIC;
 DECLARE DFHRESP_TERMIDERR     FIXED BIN(31) VALUE(26) STATIC;
 DECLARE DFHRESP_MAPFAIL       FIXED BIN(31) VALUE(36) STATIC;
 DECLARE DFHRESP_PGMIDERR      FIXED BIN(31) VALUE(27) STATIC;
 DECLARE DFHRESP_TRANSIDERR    FIXED BIN(31) VALUE(28) STATIC;
 DECLARE DFHRESP_EXPIRED       FIXED BIN(31) VALUE(31) STATIC;
 DECLARE DFHRESP_LENGERR       FIXED BIN(31) VALUE(22) STATIC;
 DECLARE DFHRESP_ITEMERR       FIXED BIN(31) VALUE(26) STATIC;

 /* AID Keys */
 DECLARE DFHENTER              CHAR(1) VALUE(X'7D') STATIC;
 DECLARE DFHCLEAR              CHAR(1) VALUE(X'6D') STATIC;
 DECLARE DFHPA1                CHAR(1) VALUE(X'6C') STATIC;
 DECLARE DFHPA2                CHAR(1) VALUE(X'6E') STATIC;
 DECLARE DFHPA3                CHAR(1) VALUE(X'6B') STATIC;
 DECLARE DFHPF1                CHAR(1) VALUE(X'F1') STATIC;
 DECLARE DFHPF2                CHAR(1) VALUE(X'F2') STATIC;
 DECLARE DFHPF3                CHAR(1) VALUE(X'F3') STATIC;
 DECLARE DFHPF4                CHAR(1) VALUE(X'F4') STATIC;
 DECLARE DFHPF5                CHAR(1) VALUE(X'F5') STATIC;
 DECLARE DFHPF6                CHAR(1) VALUE(X'F6') STATIC;
 DECLARE DFHPF7                CHAR(1) VALUE(X'F7') STATIC;
 DECLARE DFHPF8                CHAR(1) VALUE(X'F8') STATIC;
 DECLARE DFHPF9                CHAR(1) VALUE(X'F9') STATIC;
 DECLARE DFHPF10               CHAR(1) VALUE(X'7A') STATIC;
 DECLARE DFHPF11               CHAR(1) VALUE(X'7B') STATIC;
 DECLARE DFHPF12               CHAR(1) VALUE(X'7C') STATIC;

 /* CICS System Variables */
 DECLARE EIBRESP               FIXED BIN(31);
 DECLARE EIBRESP2              FIXED BIN(31);
 DECLARE EIBAID                CHAR(1);
 DECLARE EIBCALEN              FIXED BIN(31);
 DECLARE EIBDATE               FIXED BIN(31);
 DECLARE EIBTIME               FIXED BIN(31);
 DECLARE EIBTRNID              CHAR(4);
 DECLARE EIBTASKN              FIXED BIN(31);
 DECLARE EIBTRMID              CHAR(4);
 DECLARE EIBCPOSN              FIXED BIN(15);
 DECLARE EIBDS                 CHAR(8);
 DECLARE EIBFN                 CHAR(2);
 DECLARE EIBRCODE              CHAR(6);

 /* Communication Area */
 DECLARE DFHCOMMAREA           CHAR(32767) BASED(COMMAREA_PTR);
 DECLARE COMMAREA_PTR          POINTER;

 /* File Names */
 DECLARE CUSTFILE_NAME         CHAR(8) VALUE('CUSTFILE') STATIC;
 DECLARE ACCTFILE_NAME         CHAR(8) VALUE('ACCTFILE') STATIC;
 DECLARE TXNFILE_NAME          CHAR(8) VALUE('TXNFILE')  STATIC;
 DECLARE AUDITLOG_NAME         CHAR(8) VALUE('AUDITLOG') STATIC;

 /* Map Names */
 DECLARE CUSTMAP_NAME          CHAR(8) VALUE('CUSTMAP')  STATIC;
 DECLARE ACCTMAP_NAME          CHAR(8) VALUE('ACCTMAP')  STATIC;
 DECLARE MENUMAP_NAME          CHAR(8) VALUE('MENUMAP')  STATIC;
 DECLARE XFERMAP_NAME          CHAR(8) VALUE('XFERMAP')  STATIC;

 /* Transaction IDs */
 DECLARE CUST_TXN_ID           CHAR(4) VALUE('CUST') STATIC;
 DECLARE ACCT_TXN_ID           CHAR(4) VALUE('ACCT') STATIC;
 DECLARE XFER_TXN_ID           CHAR(4) VALUE('XFER') STATIC;
 DECLARE MENU_TXN_ID           CHAR(4) VALUE('MENU') STATIC;
 DECLARE BTCH_TXN_ID           CHAR(4) VALUE('BTCH') STATIC;

 /* Program Names */
 DECLARE BNKCUST_PGM           CHAR(8) VALUE('BNKCUST')  STATIC;
 DECLARE BNKACCT_PGM           CHAR(8) VALUE('BNKACCT')  STATIC;
 DECLARE BNKXFER_PGM           CHAR(8) VALUE('BNKXFER')  STATIC;
 DECLARE BNKBATCH_PGM          CHAR(8) VALUE('BNKBATCH') STATIC;
 DECLARE BNKCREDT_PGM          CHAR(8) VALUE('BNKCREDT') STATIC;
 DECLARE BNKAUDIT_PGM          CHAR(8) VALUE('BNKAUDIT') STATIC;

 /* Container Names */
 DECLARE CONTAINER_CUSTOMER    CHAR(16) VALUE('CUSTOMER-DATA')   STATIC;
 DECLARE CONTAINER_ACCOUNT     CHAR(16) VALUE('ACCOUNT-DATA')    STATIC;
 DECLARE CONTAINER_TRANSACTION CHAR(16) VALUE('TRANSACTION-DATA') STATIC;
 DECLARE CONTAINER_RESPONSE    CHAR(16) VALUE('RESPONSE-DATA')   STATIC;

 /* Channel Names */
 DECLARE CHANNEL_BANKING       CHAR(16) VALUE('BANKING-CHANNEL') STATIC;

 /* Function Codes */
 DECLARE FUNC_INQUIRY          CHAR(1) VALUE('I') STATIC;
 DECLARE FUNC_CREATE           CHAR(1) VALUE('C') STATIC;
 DECLARE FUNC_UPDATE           CHAR(1) VALUE('U') STATIC;
 DECLARE FUNC_DELETE           CHAR(1) VALUE('D') STATIC;
 DECLARE FUNC_LIST             CHAR(1) VALUE('L') STATIC;

 /* Screen Attributes */
 DECLARE ATTR_PROTECTED        CHAR(1) VALUE(X'60') STATIC;
 DECLARE ATTR_UNPROTECTED      CHAR(1) VALUE(X'40') STATIC;
 DECLARE ATTR_BRIGHT           CHAR(1) VALUE(X'C8') STATIC;
 DECLARE ATTR_DARK             CHAR(1) VALUE(X'4C') STATIC;
